# Припускаємо, що вибір мови користувача зберігається у словнику, де ключ - user_id, а значення - вибрана мова
user_languages = {}

# Ваші тексти для різних мов
locales = {
    'uk': {
        'language': 'український🇺🇦',
        # Додайте інші тексти для української мови
    },
    'ru': {
        'language': 'русский🇷🇺',
        # Додайте інші тексти для російської мови
    },
    'en': {
        'language': 'English🇺🇸',
        # Додайте інші тексти для англійської мови
    }
}

def get_user_language(user_id):
    # Отримуємо мову користувача із збереженого вибору
    user_language = user_languages.get(user_id, 'ru')  # За замовчуванням - російська 'ru'
    
    return user_language
  
